## Staging: api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show Summary</summary>

| CHANGE |                               NAME                               |
|--------|------------------------------------------------------------------|
| add    | `aws_route53_resolver_firewall_rule_group_association.api_rules` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_resolver_firewall_rule_group_association.api_rules will be created
  + resource "aws_route53_resolver_firewall_rule_group_association" "api_rules" {
      + arn                    = (known after apply)
      + firewall_rule_group_id = "rslvr-frg-29df3f1a32ee4000"
      + id                     = (known after apply)
      + mutation_protection    = (known after apply)
      + name                   = "ApiRules"
      + priority               = 101
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-024adeef6279a5350"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the top-level parameter object_lock_enabled and the
aws_s3_bucket_object_lock_configuration resource instead

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_vpc_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_resolver_firewall_rule_group_association.api_rules"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_resolver_query_log_config.route53_vpc_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sts"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_ip_set.ip_allowlist"]

27 tests, 17 passed, 10 warnings, 0 failures, 0 exceptions

```

</details>
